In [1]:
import pandas as pd
import numpy as np
import seaborn as sns

In [2]:
df= pd.read_csv("user_login.csv")

In [3]:
df.head()

,LOGINKEY,USERID,WORKINGAGENTLOCATIONID,LOGINDATE,REMOTEADDRESS,LOGINSTATUS,OTP,OTPTIME
0,1747979323456910,41400bashak,414259,27/05/17 19:18,172.30.76.14,1,NaN,NaN
1,1620894543366010,63400vilasp,634016,15/11/16 18:07,10.172.31.3,1073741825,NaN,NaN
2,1752115678196090,35600libiv,784198,09/09/17 04:58,10.45.1.16,1073741825,NaN,NaN
3,1880662888527650,632289590683995,784167,21/03/18 19:20,172.30.10.75,1,NaN,NaN
4,1744617382730770,51200bushrak,512267,24/05/17 09:25,172.30.106.23,1,NaN,NaN

In [4]:
print(df['USERID'].value_counts())

19999fla1          250
35600varsha         11
199999super1         9
299999fla1           4
19999cash2           3
                  ...
41400hamsat          1
365667474246797      1
63400nihalm          1
784000sanjay         1
78400afsalm          1
Name: USERID, Length: 3077, dtype: int64

In [5]:
ld = df['WORKINGAGENTLOCATIONID'].value_counts().to_frame()

In [6]:
print(ld.iloc[0][0])  # Count of the highest WorkingAgent Location ID

296

In [7]:
print(ld.head(1))  # 300001 is the highest working agent location id

        WORKINGAGENTLOCATIONID
300001                     296

In [8]:
print(df['REMOTEADDRESS'].value_counts())

172.30.10.75    551
172.30.9.75      90
172.30.4.100     69
172.30.90.25     31
172.30.36.21     30
               ...
10.45.0.97        1
172.30.76.13      1
172.30.34.22      1
172.30.20.74      1
10.175.10.45      1
Name: REMOTEADDRESS, Length: 1275, dtype: int64

In [9]:
del df['OTP']  # Removing OTP Column as it is not adding value

In [10]:
del df['OTPTIME'] # Removing OTP Time Column as it is not adding value